[
    {
        "title": "BLOG VISTA",
        "ProjectCat": "Blog Website",
        "imag": "",
        "desc": "<ul class=\"project-details\"> <li>Developed a blogging website where users can post their blogs after signing up (login/register), and give feedback on other users' blogs</li> <li>Made responsive UI using Material-UI, React for dynamic component rendering, and optimized API interactions using Axios interceptors</li> <li>Established backend with an Express (Node) server, incorporating middlewares, and connecting to MongoDB for seamless data storage</li> <li>Built RESTful API routes and controllers, handling comments & posts, employed JWT for secure authentication, and Bcrypt for hashing</li> </ul>",
        "link": "",
        "github": "https://github.com/shreyans00/Blog_Vista"
    },
    {
        "title": "C++ Online Compiler",
        "ProjectCat": "Compiler",
        "imag": "compiler.png",
        "desc": "<ul class=\"project-details\"> <li>Built an efficient online C++ compiler platform, facilitating seamless compilation and execution of cpp code within a Node.js environment</li> <li>Ensured secure execution of each instance of the cpp code within Docker runtime, ensuring the security & isolation of the hosting device</li> <li>Established authentication using JWT, Bcrypt hashing, Nodemailer for OTP-based email verification, and MongoDB Atlas for data storage</li> </ul>",
        "link": "",
        "github": "https://github.com/shreyans00/cpp-compiler"
    },
    {
        "title": "EDUCATE BHARAT",
        "ProjectCat": "E-learning Website",
        "imag": "ebharat.png",
        "desc": "<ul class=\"project-details\"> <li>Developed a course-centric website hosted on Render which offers course and educator details, registration, login and logout features</li> <li>Employed HTML, CSS, Handlebars, and Javascript for frontend development, while utilsing Node.js, Express.js for backend integration</li> <li>Incorporated MongoDB database with Mongoose library, facilitating registration, and leveraged MongoDB Atlas for cloud data storage</li> <li>Implemented security using Bcrypt for password hashing, email validation through Validators, and employed JWT for user authentication</li> </ul>",
        "link": "https://ebharat.onrender.com",
        "github": "https://github.com/shreyans00/EducateBharat"
    },
    {
        "title": "AUTOMATIC HOME AND STREET LIGHTING",
        "ProjectCat": "Automatic Lighting System",
        "imag": "light.png",
        "desc": "<ul class=\"project-details\"> <li>Designed an automated room and street lighting system based on human presence using Infrared sensor, and real-time person-tracking</li> <li>Calculated BOM cost (Rs. 920), conducted compatibility tests, discussed pin configurations, and analyzed battery life (range: 16 to 32 hrs)</li> <li>Executed a simulation in Proteus, integrating it with Arduino IDE's coded solution, and successfully implemented hardware simulations</li> </ul>",
        "link": "https://docs.google.com/presentation/d/187MnUm6JQDNlKfsq1d0jAeDd3WQR__zsH8rhqK_BJpo/edit#slide=id.g22d7db48866_4_4",
        "github": "#"
    },
    {
        "title": "HOMI JEHANGIR",
        "ProjectCat": "Hall Website",
        "imag": "hjb.png",
        "desc": "<ul class=\"project-details\"> <li>Developed a comprehensive, responsive website for HJB Hall, serving as the official central hub for hall-related news and information</li> <li>Designed the prototype of the website using Figma and utilized HTML, CSS, and Javascript to develop multiple pages of the frontend</li> <li>Employed asynchronous fetch operations to load gallery JSON data, dynamically updates year, and event content with event listeners</li> </ul>",
        "link": "https://hjb.iitkgp.co.in/html/index.html",
        "github": "https://github.com/HJB-IITKGP/frontEnd"
    },
    {
        "title": "SERVICE HUT",
        "ProjectCat": "Business Model",
        "imag": "service.png",
        "desc": "<ul class=\"project-details\"> <li>Conceptualized a robust business model, strategically connecting registered service providers with consumers through a web application</li> <li>Segmented the market, identified target market, analysed competitive landscape, and listed points of parity and points of difference</li> <li>Conducted approximate cost analysis over a year ($139,500), resulting in a comprehensive Feasibility Analysis, evaluating venture viability</li> </ul>",
        "link": "https://docs.google.com/presentation/d/1Gbobz7SjdBzK1Ko5BC3SEhMiWlbFWB5x/edit#slide=id.p1",
        "github": "#"
    },
    {
        "title": "DITCH THE SWITCH",
        "ProjectCat": "Home Automation System",
        "imag": "diy.png",
        "desc": "<ul class=\"project-details\"> <li>Designed a device which keeps track of people entering and leaving a room using two ultrasonic sensors, and turns off the appliances when no one in the room with some cooldown time.</li> <li>Designed a device which keeps track of people entering and leaving a room using two ultrasonic sensors, and turns off the appliances when no one in the room with some cooldown time.</li> <li>The Switching mechanism is controlled by the L293D Motor Drive IC Chip which sets pins to high and low.</li> </ul>",
        "link": "https://docs.google.com/document/d/11XFrv8rDi5Nk8OgJf-OLQRyvJxjyvDCsu8nY1wldQBs/edit",
        "github": "#"
    },
    {
        "title": "DIGITAL THERMOMETER",
        "ProjectCat": "Temperature Measurement",
        "imag": "thermo.png",
        "desc": "<ul class=\"project-details\"> <li>Designed a thermistor using Arduino to measure temperature within the range (0-150°C), achieving resolution of 0.1°C & accuracy of ±1°C</li> <li>Employed NTC (Negative Temperature Coefficient) for cost-effective temperature measurement, leveraging the Steinhart-Hart equation</li> </ul>",
        "link": "https://docs.google.com/document/d/11XFrv8rDi5Nk8OgJf-OLQRyvJxjyvDCsu8nY1wldQBs/edit",
        "github": "#"
    },
    {
        "title": "WRITING BOARD",
        "ProjectCat": "Image Processing",
        "imag": "board.png",
        "desc": "<ul class=\"project-details\"> <li>Made a whiteboard that follows the ball (circle detection) in the user's hand as a pen pointer to write in the air.</li> <li>Converted the image to grayscale, applied a median blur to reduce noise, and drew the circle in the output image.</li> </ul>",
        "link": "https://docs.google.com/document/d/1J1oHm2ujEb2HFoAPJjhBwT1kpEeuzW-FFvqDeLvHfR4/edit",
        "github": "#"
    }
]